In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ], 
    columns=[f'co{r}'for r in range(1,11)]
)
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [8]:
# 첫 번째 행 추출
df.loc[0]
df.iloc[0]

co1      1
co2      3
co3      5
co4      7
co5      9
co6     11
co7     13
co8     15
co9     17
co10    19
Name: 0, dtype: int64

In [11]:
# 마지막 행 추출
df.loc[2]
df.iloc[2]
df.iloc[-1]

co1      10
co2      20
co3      30
co4      40
co5      50
co6      60
co7      70
co8      80
co9      90
co10    100
Name: 2, dtype: int64

In [14]:
# 첫 번째 ~ 두 번째 행 추출
df.loc[0:1]
df.iloc[0:2]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20

In [20]:
type(df.co2)

pandas.core.series.Series

In [18]:
# 시리즈를 데이터프레임으로 출력
df.co2
df[['co2']]
df.loc[:,['co2']]
df.iloc[:,[1]]

   co2
0    3
1    4
2   20

In [19]:
df[0:1]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19

In [21]:
# 상위 2개 행 추출
df.head(2)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20

In [23]:
# 하위 1개 행 추출
df.tail(1)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
2   10   20   30   40   50   60   70   80   90   100